<center>

<table width="90%">

    <tbody>

        <tr>

            <td><font face="arial"><strong><font size="3">Exporta&ccedil;&atilde;o da base de dados para um arquivo TXT com r&oacute;tulos</font></strong>

            <p><font face="arial"></font></p>

            <p align="justify"><font size="2">Para exportar uma base de dados na forma de um arquivo TXT com r&oacute;tulos, se utiliza uma das tabelas de convers&atilde;o j&aacute; definidas na op&ccedil;&atilde;o de <strong>Importa&ccedil;&atilde;o</strong>. (Ver </font><a target="_blank" href="ayuda.php?help=es/txt2isis.html"><font size="2">Tabelas de convers&atilde;o</font></a><font size="2">)</font></p>

            <p align="justify"><font size="2">Para executar a exporta&ccedil;&atilde;o, siga o seguinte procedimento:</font></p>

            <ol>

                <li>

                <div align="justify"><font size="2">Selecione a tabela de convers&atilde;o a utilizar no processo. Para isso clique na op&ccedil;&atilde;o <strong>Selecionar</strong> que acompanha cada tabela de convers&atilde;o exibida na janela</font></div>

                </li>

                <li>

                <div align="justify"><font size="2">Selecione os registros que deseja exportar atrav&eacute;s das op&ccedil;&otilde;es previstas:</font></div>

                <ul>

                    <li>

                    <div align="justify"><font size="2">Faixa de MFN</font></div>

                    </li>

                    <li>

                    <div align="justify"><font size="2">Pesquisa</font></div>

                    </li>

                    <li>

                    <div align="justify"><font size="2">Uma letra do gloss&aacute;rio</font></div>

                    </li>

                </ul>

                </li>

                <li>

                <div align="justify"><font size="2">Selecione a sa&iacute;da onde quer ver o arquivo TXT com os registros exportados, segundo as seguintes op&ccedil;&otilde;es:</font></div>

                </li>

                <li>

                <div align="justify"><font size="2">Processador de texto</font></div>

                </li>

                <li>

                <div align="justify"><font size="2">Visualizar</font></div>

                </li>

            </ol>

            <p align="justify"><font size="2">Uma vez selecionados os registros a exportar, digite na caixa o nome do arquivo ISO a gerar e clique no &iacute;cone <img alt="" src="../../php/dataentry/img/barSave.png" />.</font></p>

            <p align="justify"><font size="2">Ao terminar a gera&ccedil;&atilde;o do arquivo
            TXT &eacute; exibida uma p&aacute;gina com o resultado e um link para o arquivo
            TXT gerado. Para baixar o arquivo TXT, posicione o mouse sobre o link e clicando com o bot&atilde;o direito ter&aacute; acesso a op&ccedil;&atilde;o que permite salvar o
            TXT no seu computador.</font></p>

            <p align="justify"><font size="2">Posteriormente, no processo de importa&ccedil;&atilde;o, se exibir&aacute; o
            TXT gerado como parte da lista dos arquivos residentes na pasta <strong>/bases/wrk</strong>.</font></p>

              <p align="justify"><font size="2"><strong><em>Nota importante</em>.</strong>: No caso de a base dedados ter muitos registros, recomenda-se usar o utilit&aacute;rio <strong>MX</strong> para a gera&ccedil;&atilde;o do arquivo
              TXT</font></p>

            </font></td>

        </tr>

    </tbody>

</table>

</center>