
<p><font face="Arial" size="3"><strong>Planilhas de Entrada de dados</strong></font></p>

<p><font face="Arial" size="2">O sistema mant&eacute;m uma planilha de entrada de 
dados, por default, constru&iacute;da atrav&eacute;s da <strong>.FDT</strong>.
 Podem ser elaboradas outras planilhas de entrada, as quais incluem apenas as 
 etiquetas dos campos a incorporar, pois as restantes s&atilde;o obtidas 
 diretamente da <strong>FDT</strong></font>.</p> 

<p><strong><font face="Arial" size="2">Planilha 
de entrada 
de dados (FMT)</font></strong></span></p> 

<p><font face="Arial" size="2">Permite criar planilhas de entrada de dados 
adicionais, as quais podem ser selecionadas&nbsp;no momento da entrada da 
informa&ccedil;&atilde;o utilizando o menu indicado por 
Planilha,&nbsp;apresentado na parte superior da janela do ABCD.</font></p> 

<p><font face="Arial"><font size="2"><strong>Criar uma nova planilha de 
entrada<br />

</strong><br />

Selecione da lista de campos&nbsp;aqueles que ir&atilde;o fazer parte 
da&nbsp;planilha de 
entrada de dados. Para selecionar um campo::</font></font></p>

<ul>

    <li><font face="Arial" size="2">Dar um duplo clique sobre&nbsp;
    campo</font></li>

    <li><font face="Arial" size="2">Clicar sobre um campo e alargar a sele&ccedil;&atilde;o&nbsp;com&nbsp;as teclas&nbsp;[Shift]&nbsp;ou [Ctrl-Shift]&nbsp;
    e em seguida clicar sobre a seta que aponta para a direita</font> </li> 

    <li><font face="Arial" size="2">Para copiar todos os campos da FDT, clique 
    sobre&nbsp;a seta dupla que aponta para a direita</font></li> 
</ul>

<p><font face="Arial" size="2">Para eliminar campos da planilha de entrada de 
dados::</font></p>

<ul>

    <li><font face="Arial" size="2">Dar duplo clique&nbsp; sobre&nbsp;o&nbsp;
    campo</font> </li>

    <li><font face="Arial" size="2">Clicar sobre um campo e expandir a sele&ccedil;&atilde;o
    &nbsp;com&nbsp;as teclas&nbsp;[Shift]&nbsp;&nbsp;ou&nbsp;[Ctrl-Shift]&nbsp;
    e em seguida clicar  sobre a seta&nbsp;</font>que aponta para a esquerda </li> 

    <li><font face="Arial" size="2">Para&nbsp;excluir todos os campos da planilha de 
    entrada, clicar sobre a seta dupla que aponta para a esquerda</font>&nbsp; </li> 
</ul>

<p><font face="Arial" size="2">Os campos extra&iacute;dos da planilha de entrada 
ser&atilde;o colocados, no final, da janela contendo a lista de campos</font>.</p> 

<p><font face="Arial" size="2">Use os bot&otilde;es </font> 
  <input type="button" name="subir" value="Voltar" />
<font face="Arial" size="2">&nbsp;ou </font><input type="button" name="bajar" value="Avan&ccedil;ar" /> 
<font face="Arial" size="2">&nbsp;para posicionar os campos na planilha de 
entrada de dados.</font></p>

<p><font face="Arial" size="2">Use o link <em>Visualizar</em> <img alt="" src="../../php/dataentry/img/preview.gif" />  
para&nbsp;pr&eacute;-visualizar a planilha de entrada de dados em constru&ccedil;&atilde;o.</font></p> 

<p><font face="Arial" size="2">Quando terminar a planilha, insira no campo Nome o nome da planilha 
(nome do arquivo interno) e em descri&ccedil;&atilde;o, incluir uma breve 
explica&ccedil;&atilde;o sobre a planilha criada. O&nbsp;nome da planilha 
deve conter letras, n&uacute;meros ou o caracter _, devendo sempre 
come&ccedil;ar por uma letra. N&atilde;o s&atilde;o aceitos espa&ccedil;os 
nem caracteres especiais. A&nbsp;descri&ccedil;&atilde;o deve ser resumida e 
curta de modo a poder ser visualizada no menu&nbsp;Planilha localizado na 
parte superior da janela principal de&nbsp;ABCD.</font></p> 

<p></font><strong><font face="Arial" size="2">Modificar uma planilha de 
entrada de dados j&aacute; existente</font></strong></p> 

<p><font face="Arial" size="2">Selecione no menu pull down&nbsp; a planilha 
que pretende editar e clique em <strong><u>Editar</u></strong>. Com a 
informa&ccedil;&atilde;o da planilha  se preencher&aacute; a janela&nbsp;
<strong>Campos selecionados. </strong>Siga as instru&ccedil;&otilde;es 
mencionadas anteriormente para adicionar ou excluir campos da planilha.</font></p> 

<p><strong><font face="Arial" size="2">Excluir uma planilha de entrada j&aacute;
 existente</font></strong></p> 

<p><font face="Arial" size="2">Selecione do menu suspenso a planilha que pretende 
excluir e clique sobre&nbsp;<u><strong>Excluir</strong></u>.</font></p> 

<font face="Arial" size="2"><hr />

<p>&nbsp;</p>

</font>
<p><font face="Arial" size="2">As planilhas criadas s&atilde;o guardadas na 
pasta <strong>def </strong>da pasta da base de dados, com a extens&atilde;o&nbsp;
<strong>.fmt</strong>. A lista das planilhas existentes est&aacute; no arquivo 
&nbsp;<strong>formatos.wks</strong>, no qual consta uma linha para cada 
planilha, com o nome e a descri&ccedil;&atilde;o separados pelo caracter&nbsp;
<strong>|</strong> .</font></p> 

<p><font face="Arial" size="2">Exemplo de uma planilha:</font></p>

<font face="Arial" size="2"><p><font face="Courier New" size="2">H||Entradas principais|0|0|||||||||||<br />

100<br />

110<br />

111<br />

240<br />

242<br />

245<br />

246<br />

250<br />

260<br />

300<br />

310</font></p>

</font>
<p><font face="Arial" size="2">Como se pode observar,&nbsp;a planilha de entrada&nbsp;criada inclui as linhas da FDT do tipo <strong>H </strong>(cabe&ccedil;alho) ou <strong>L </strong>(linha divis&oacute;ria) e as etiquetas dos campos selecionados. Isto significa que  altera&ccedil;&otilde;es realizadas&nbsp;na FDT,&nbsp;depois da cria&ccedil;&atilde;o das planilhas de entrada, ser&atilde;o apresentadas no momento da sele&ccedil;&atilde;o da planilha de entrada correspondente.</font></p> 

<font face="Arial" size="2"></font>
<p><font size="2" face="Arial">O arquivo&nbsp;<strong>formatos.wks</strong> serve para preencher o menu 
&nbsp;<strong>Planilha de entrada de dados. </strong>Quando uma planilha &eacute; criada ou exclu&iacute;da,  
&eacute; atualizado de forma autom&aacute;tica o menu&nbsp; 
<strong>Planilha de entrada de dados </strong>apresentado na parte superior 
da janela principal.</font></p> 
