<p><font face="Arial" size="3"><strong>Arquivos de ajuda para os campos da base de dados</strong></font></p>

<p><font face="Arial" size="2">Para definir as ajudas de cada campo na entrada de dados siga os seguintes passos:</font></p>

<ol>

    <li><font face="Arial" size="2">Selecione no menu <strong>Tabela de defini&ccedil;&atilde;o de campos (FDT) </strong>o campo
      para o qual pretende adicionar a ajuda</font><font face="Arial" size="2">&nbsp;</font></li>

    <li><font face="Arial" size="2">Realizada a sele&ccedil;&atilde;o aparecer&aacute; no quadro as
      caracter&iacute;sticas do campo, conforme foi definido na tabela de defini&ccedil;&atilde;o de
      campos (FDT)</font></li>

    <li><font face="Arial" size="2">Dever&aacute; clicar sobre <strong>Visualizar</strong> para visualizar a ajuda, se esta n&atilde;o estiver presente</font></li>

    <li><font face="Arial" size="2">Clicar sobre <strong>Editar arquivo de ajuda</strong> para criar a ajuda ou modificar a j&aacute; existente. Ser&aacute; apresentado o editor de HTML para que possa escrever o texto de ajuda</font></li>

    <li><font face="Arial" size="2">Para terminar a edi&ccedil;&atilde;o da ajuda, clicar sobre
      <strong>Salvar ajuda</strong> para atualizar o arquivo</font></li>

    <li><font face="Arial" size="2">Os arquivos de ajuda dos campos s&atilde;o guardados
      no diret&oacute;rio <strong>/bases/<em>dbn</em>/ayudas/tag_xxx.html</strong>, onde <strong>dbn </strong>&eacute; o nome da base de dados e <strong>xxx</strong>&nbsp;representa a etiqueta do campo a que corresponde a ajuda. Este nome &eacute; fornecido pelo sistema de forma autom&aacute;tica e n&atilde;o deve ser modificado j&aacute; que serve de refer&ecirc;ncia para o procedimento de entrada da apresenta&ccedil;&atilde;o da ajuda.</font></li>

    <li><font face="Arial" size="2">Una vez conclu&iacute;dos os arquivos de ajuda, deve editar a&nbsp;FDT da base de dados&nbsp;para marcar, na coluna correspondente, quais os campos para
      os quais foram estabelecidos arquivos de ajuda.</font>&nbsp;</li>

</ol>