<center>

<table width="90%">

    <tbody>

        <tr>

            <td><font face="arial"><strong><font size="3">Carregar um arquivo ISO</font></strong>

            <p><font face="arial"></font></p>

            <p align="justify"><font size="2">Os arquivos <strong>ISO</strong> que s&atilde;o gerados na exporta&ccedil;&atilde;o s&atilde;o gravados na pasta <strong>./bases/wrk</strong>. Para importar um arquivo <strong>ISO</strong> clique na op&ccedil;&atilde;o <font   face="arial" size="2"><strong>Selecionar</strong> que acompanha o ISO a importar.</font></p>

            <p align="justify"><font size="2">No caso de desejar substituir a base de dados com o resultado dos registros importados, marque a caixa identificada como <strong><font   face="arial" size="2">Apagar todos os registros antes de importar</font></strong><font color="#000000">. Se esta caixa n&atilde;o for marcada, os registros importados ser&atilde;o carregados no final da base de dados.</font></font></p>

            <p align="justify"><font size="2">Se deseja atualizar o arquivo invertido enquanto importa os registros, marque a caixa identificada como <strong><font   face="arial" size="2">Gerar arquivo invertido</font></strong><font color="#000000">. Se esta caixa n&atilde;o for marcada, dever&aacute; gerar o arquivo invertido ap&oacute;s o processo
            de importa&ccedil;&atilde;o com a op&ccedil;&atilde;o do menu de <strong>Manuten&ccedil;&atilde;o</strong> da base de dados.</font></font></p>

            <p align="justify"><font size="2"><strong><em>Nota importante</em>.</strong>: Se a base de dados tem muitos registros, recomenda-se usar o utilit&aacute;rio <strong>mx</strong> para gerar o arquivo invertido</font></p>

            <p align="justify"><font size="2">Se o arquivo ISO que se deseja importar n&atilde;o est&aacute; no servidor, deve-se primeiro
            carregar a arquivo antes de iniciar a importa&ccedil;&atilde;o. Para isso utilize a se&ccedil;&atilde;o
            <strong><font   face="arial" size="2">Carregar arquivo ISO</font></strong> que &eacute; exibida na tela de importa&ccedil;&atilde;o. Uma vez transferido o arquivo, pode import&aacute;-lo.</font></p>

            <p align="justify"><font size="2"><strong><em>Nota importante</em>.</strong>: o
            arquivo ISO a importar deve ter as mesmas etiquetas e subcampos da base de dados j&aacute; que n&atilde;o existe uma <em>FST</em> de importa&ccedil;&atilde;o/reformata&ccedil;&atilde;o para realizar mudanças na estrutura dos campos.</font></p>

            <p align="justify"><font size="2">Se o arquivo ISO a carregar for muito grande, deve-se utilizar <strong>FTP</strong> ou
            outro meio para carreg&aacute;-lo ao servidor.</font></p>

            <p align="justify"><font size="2">Use a op&ccedil;&atilde;o <strong>Apagar</strong> que acompanha cada arquivo ISO apresentado, para apagar do servidor os arquivos ISO j&aacute; utilizados.</font></p>

            <ol><font size="2">&nbsp;</font></ol>

                </font></td>

            </tr>

        </tbody>

    </table>

    </center>