<p><strong><font size="3"><font face="Arial"><font size="3">Captura de termos normalizados a partir de uma tabela</font><br />

</font></font></strong><font size="2"><font face="Arial"><br />

Esta op&ccedil;&atilde;o do ABCD  permite criar tabelas de valores que ser&atilde;o exibidos na entrada de dados  correspondente. A forma como&nbsp;
a tabela ser&aacute; exibida depender&aacute; do <strong>Tipo de entrada</strong> atribu&iacute;da ao campo na FDT
(Checkbox, Sele&ccedil;&atilde;o simples, Sele&ccedil;&atilde;o m&uacute;ltipla, R&aacute;dio, etc.). As tabelas de valores s&atilde;o armazenadas na pasta <strong>def</strong> da base de dados selecionada.<br />

<br />

Para <strong>criar</strong> uma nova tabela informe na coluna <strong>Nome</strong> o nome da mesma, com a extens&atilde;o <strong>.tab </strong>e clique sobre
<strong>Browse.</strong><br />

Para <strong>visualizar</strong> uma tabela existente clique na imagem <img alt="" src="../../php/dataentry/img/preview.gif" /> ou no nome da tabela correspondente.<br />

<br />

Para <strong>editar</strong> uma tabela existente clique no nome da mesma e clique em
<strong>Browse.<br />

<br />

</strong>Para <strong>atribuir </strong> um campo a uma tabela existente, clique no nome da mesma e clique em <strong>atualizar FDT</strong>.<br />

<br />

Para <strong>eliminar</strong> uma tabela existente clique no nome da mesma e clique em <strong>excluir</strong>. A tabela ser&aacute; deletada da pasta, mas permanecer&aacute; associada ao
respectivo campo na FDT. Lembre-se, ent&atilde;o, de excluir a entrada na FDT.<br />

<br />

A lista de tabelas dispon&iacute;veis exibe todos os arquivos com a extens&atilde;o <strong>.tab </strong>localizados na pasta<strong> def</strong> da base de dados selecionada.<br />

<br />

<strong>Cria&ccedil;&atilde;o/Edi&ccedil;&atilde;o de tabelas<br />

<br />
</strong>Uma vez que o nome do arquivo tenha sido digitado na coluna <strong>Nome</strong>, clique em
<strong>Browse</strong>. A sele&ccedil;&atilde;o ser&aacute; exibida numa tabela com duas colunas: <strong>C&oacute;digo |&nbsp; Termo</strong><br />

<br />

Se somente a coluna <strong>termo</strong> &eacute; preenchida, no procedimento de entrada ser&atilde;o exibidos os valores colocados nesta coluna, os quais ser&atilde;o transferidos ao campo correspondente, utilizando o m&eacute;todo de sele&ccedil;&atilde;o
apropriado ao tipo de entrada do campo definido na FDT.<br />

<br />

Se deseja transferir tanto o c&oacute;digo como o termo associado, ent&atilde;o a estrutura do campo que vai
receber o valor da tabela deve contemplar 2 subcampos. No primeiro subcampo, ser&aacute; inclu&iacute;do o valor correspondente ao <strong>c&oacute;digo</strong> e no segundo subcampo ser&aacute;
colocado o valor correspondente ao termo.</font></font><font size="2"><font face="Arial">No procedimento de entrada ser&atilde;o exibidos somente os valores presentes na coluna <strong>termo,</strong> mas armazenar&aacute; o c&oacute;digo mais o termo, utilizando os subcampos correspondentes</font></font>.</p>

<p><font size="2"><font face="Arial">Ao terminar a edi&ccedil;&atilde;o da tabela, clique no bot&atilde;o <strong>Atualizar</strong> para salvar a tabela criada/modificada
e atribuindo-a ao campo correspondente na FDT.</font></font></p>

<p><font face="Arial" size="2"><strong>Dica: </strong>Para utilizar numa base de dados A uma tabela j&aacute; definida para a base de dados B,
o nome da Picklist deve ser precedido com o caminho correto 

onde est&aacute; localizada a tabela que deseja usar.<br />

<br />

<br />

<br />

<br />

</font></p>