<font face="arial" size="2">

<h3>Pesquisa Avançada&nbsp;</h3>

<p>O formul&aacute;rio de pesquisa avançada &eacute; definido na se&ccedil;&atilde;o de Defini&ccedil;&atilde;o de Bases de Dados e cont&eacute;m os campos que estão indexados na FST e que são pesquis&aacute;veis a partir do &iacute;ndice de pesquisa.</p>

<p>Para fazer uma pesquisa avançada devem ser executados os seguintes passos:</p>

<ol>

    <li>Selecionar o campo objeto da pesquisa </li>

    <li>Clicar em <strong>Índice</strong> para consultar o Índice relacionado ao campo </li>

    <li>Selecionar no &iacute;ndice os termos para a pesquisa. Para isso h&aacute; duas op&ccedil;&otilde;es:

    <ul>

        <li>Selecionar o termo e clicar em <strong>Pesquisar</strong> para fazer a pesquisa
          diretamente sobre o termo selecionado </li>

        <li>Selecionar o termo e clicar sobre <strong>Transferir o termo
          selecionado</strong> para transferir o termo para o formul&aacute;rio de pesquisa e construir uma expressão de pesquisa que combine informa&ccedil;&atilde;o proveniente de mais de um campo </li>

    </ul>

    </li>

    <li>Se não for utilizado o &iacute;ndice de pesquisa, pode-se entrar na caixa correspondente&nbsp;palavras relevantes da informa&ccedil;&atilde;o a ser localizada. Para que esta op&ccedil;&atilde;o funcione, &eacute; necess&aacute;rio indexar o campo com a t&eacute;cnica 4 (por palavras) na FST. Se não
      selecionar nenhum campo da lista de sele&ccedil;&atilde;o de campos pesquis&aacute;veis, a pesquisa incidir&aacute; sobre todos os campos da base de dados que tenham sido indexados.</li>

    <li>Logo que a sele&ccedil;&atilde;o esteja completada, clicar sobre <img alt="" src="../../php/dataentry/img/barSearch.png" /> para fazer a pesquisa na base de dados e localizar os
      registros, ou sobre <img alt="" src="../../php/dataentry/img/barDelete.png" /> para limpar os termos de pesquisa. </li>

</ol>

<p>Os registros localizados s&atilde;o apresentados na janela da base de dados para facilitar a edi&ccedil;&atilde;o.</p>
<p>As express&otilde;es de pesquisa salvas s&atilde;o armazenadas em um arquivo TXT na pasta <strong>pfts/[lang]</strong> com o nome de <strong>search_expr.tab</strong>. Este arquivo pode ser administrado través das opções contidas em <strong>Atualizar definições de bases de dados </strong>do menu principal de catalogação.</p>
<p>A partir da op&ccedil;&atilde;o para gerar saídas tamb&eacute;m se pode salvar e recuperar as express&otilde;es de pesquisa previamente salvas.</p>
<p>Se for adicionada a uma caixa de de pesquisa masi de uma express&atilde;o previamente salva, as mismas s&atilde;o concatenadas com o operador booleano AND</p>
<p>&nbsp;</p>

<p>&nbsp;</p>

<p>&nbsp;</p>

</font>